{
  "author": "Bold Muddy",
  "subtitle": "Restoring Minecraft to its origins",
  "description": "When Bold Muddy was very young, he would enjoy watching Minecraft Videos that showcase old designs of features of Minecraft. The old gravel and bricks texture, how bright the grass block was, how the Creeper came to life. We all love and remember those designs and they truly give the vibe of simplicity to a game all about being simple yet unique.\n\nAround 4 Years ago he wanted to start a project with his friend, he never knew how to make Resource-Packs but he knew he wanted to make this pack, a way to see every single thing in Minecraft as it's oldest design. We made a Discord Server, gathered a very small amount of images and he tried recreating them, the process was very inefficient so they cancelled the project.\n\nAround the beginning of 2020 he learned how to properly make Resource-Packs but at Summer of that year he remembered of a project he forgotten about, and realized he can finally make it.\n\nThis project has been about a year in the making, and even though it looks bad, it's suppose to look like that. This truly took him an extremely long time to research on but he am very proud of what it has become!\n\nBasically this pack will take every single item, block and mob and attempt of giving it the absolute first original version they know of it. This isn't just another Beta or Alpha pack, this applies to every single feature even in 1.17! There is a VERY small amount of actual recreations, most of the textures and models are straight from early versions of Minecraft!",
  "optifine": "This pack uses OptiFine to add custom entity models, as well as unique entity textures for some baby mobs.",
  "video": "7TX20OUxw2s",
  "images": [
    "1.14+5",
    "1.5+6+7",
    "1.17",
    "old",
    "1.16",
    "1.13",
    "portal"
  ],
  "downloads": [
    {
      "text": "Download [Java]",
      "link": "http://adfoc.us/54653784845243",
      "mirror": "https://www.curseforge.com/minecraft/texture-packs/devolution/"
    }
  ],
  "links": [
    {
      "text": "By Bold Muddy",
      "link": "https://linktr.ee/boldmuddy"
    }
  ]
}